package com.gin.kotlin4android.book.recycler

import android.os.Bundle
import android.support.v7.app.AppCompatActivity
import android.support.v7.widget.LinearLayoutManager
import android.support.v7.widget.RecyclerView
import android.util.Log
import com.gin.kotlin4android.R

class RecyclerActivity : AppCompatActivity() {

    val items = listOf(
            "天魁星呼保义宋江", "天罡星玉麒麟卢俊义", "天机星智多星吴用", "天闲星入云龙公孙胜",
            "天勇星大刀关胜", "天雄星豹子头林冲", "天猛星霹雳火秦明", "天威星双鞭呼延灼",
            "天英星小李广花荣", "天贵星小旋风柴进", "天富星扑天雕李应", "天满星美髯公朱仝",
            "天孤星花和尚鲁智深", "天伤星行者武松", "天立星双枪将董平", "天捷星没羽箭张清",
            "天暗星青面兽杨志", "天佑星金枪手徐宁", "天空星急先锋索超", "天速星神行太保戴宗",
            "天异星赤发鬼刘唐", "天杀星黑旋风李逵", "天微星九纹龙史进", "天究星没遮拦穆弘",
            "天退星插翅虎雷横", "天寿星混江龙李俊", "天剑星立地太岁阮小二", "天平星船火儿张横",
            "天罪星短命二郎阮小五", "天损星浪里白条张顺", "天败星活阎罗阮小七", "天牢星病关索杨雄",
            "天慧星拼命三郎石秀", "天暴星两头蛇解珍", "天哭星双尾蝎解宝", "天巧星浪子燕青",

            "地魁星神机军师朱武", "地煞星镇三山黄信", "地勇星病尉迟孙立", "地杰星丑郡马宣赞",
            "地雄星井木犴郝思文", "地威星百胜将军韩滔", "地英星天目将彭玘", "地奇星圣水将军单廷珪",
            "地猛星神火将军魏定国", "地文星圣手书生萧让", "地正星铁面孔目裴宣", "地辟星摩云金翅欧鹏",
            "地阖星火眼狻猊邓飞", "地强星锦毛虎燕顺", "地暗星锦豹子杨林", "地轴星轰天雷凌振",
            "地会星神算子蒋敬", "地佐星小温侯吕方", "地佑星赛仁贵郭盛", "地灵星神医安道全",
            "地兽星紫髯伯皇甫端", "地微星矮脚虎王英", "地慧星一丈青扈三娘", "地暴星丧门神鲍旭",
            "地默星混世魔王樊瑞", "地猖星毛头星孔明", "地狂星独火星孔亮", "地飞星八臂哪吒项充",
            "地走星飞天大圣李衮", "地巧星玉臂匠金大坚", "地明星铁笛仙马麟", "地进星出洞蛟童威",
            "地退星翻江蜃童猛", "地满星玉幡竿孟康", "地遂星通臂猿侯健", "地周星门将周黎明",
            "地隐星白花蛇杨春", "地异星白面郎君郑天寿", "地理星九尾龟陶宗旺", "地俊星铁扇子宋清",
            "地乐星铁叫子乐和", "地捷星花项虎龚旺", "地速星中箭虎丁得孙", "地镇星小遮拦穆春",
            "地嵇星操刀鬼曹正", "地魔星云里金刚宋万", "地妖星摸著天杜迁", "地幽星病大虫薛永",
            "地伏星金眼彪施恩", "地僻星打虎将李忠", "地空星小霸王周通", "地全星鬼脸儿杜兴",
            "地孤星金钱豹子汤隆", "地角星独角龙邹润", "地短星出林龙邹渊", "地藏星笑面虎朱富",
            "地囚星旱地忽律朱贵", "地平星铁臂膊蔡福", "地损星一枝花蔡庆", "地奴星催命判官李立",
            "地察星青眼虎李云", "地恶星没面目焦挺", "地丑星石将军石勇", "地数星小尉迟孙新",
            "地阴星母大虫顾大嫂", "地刑星菜园子张青", "地壮星母夜叉孙二娘", "地劣星活闪婆王定六",
            "地健星险道神郁保四", "地耗星白日鼠白胜", "地贼星鼓上蚤时迁", "地狗星金毛犬段景"
    )

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_recycler)
        var recycler = findViewById(R.id.recycler) as RecyclerView
        recycler.layoutManager = LinearLayoutManager(this)
        recycler.adapter = RecyclerAdapter(items)

        Log.i("------", "00000000")
        
    }
}
